<template>
  <div class="wraper">
    <div class="header">
      <div class="conteiner">
        <img src="@/imges/logo.svg" alt="" class="">
      </div>
    </div>
    <div class="ferstPage">
      <div class="ferstPageLogo">
        <img src="@/imges/logoFerstPage.svg" alt="" class="ferstPageImg">
      </div>
      <div class="ferstPageContent">
        <p class="ferstPageContentTitle">
          Приватность
          и безопасность
        </p>
        <div class="ferstPageContentGrid">
          <div class="ferstPageContentRow">
            <div class="ferstPageContentItem">
              <p class="ferstPageContentItemText">Содержание</p>
            </div>
          </div>
          <div class="ferstPageContentRow">
            <div class="ferstPageContentItem" @click="scroll('id1')">
              <div class="ferstPageContentItemCounter">1</div>
              <p class="ferstPageContentItemText">Введение</p>
            </div>
            <div class="ferstPageContentItem" @click="scroll('id3')">
              <div class="ferstPageContentItemCounter">3</div>
              <p class="ferstPageContentItemText">Приватность в IT</p>
            </div>
            <div class="ferstPageContentItem" @click="scroll('id5')">
              <div class="ferstPageContentItemCounter">5</div>
              <p class="ferstPageContentItemText">Аутентификация<br/> и управление доступом</p>
            </div>
            <div class="ferstPageContentItem" @click="scroll('id7')">
              <div class="ferstPageContentItemCounter">7</div>
              <p class="ferstPageContentItemText">Перспективы развития  <br/>безопасности и приватности в IT</p>
            </div>
          </div>
          <div class="ferstPageContentRow">
            <div class="ferstPageContentItem" @click="scroll('id2')">
              <div class="ferstPageContentItemCounter">2</div>
              <p class="ferstPageContentItemText">Основные аспекты <br/>безопасности в IT</p>
            </div>
            <div class="ferstPageContentItem" @click="scroll('id4')">
              <div class="ferstPageContentItemCounter">4</div>
              <p class="ferstPageContentItemText">Технологии обеспечения <br/>безопасности в IT</p>
            </div>
            <div class="ferstPageContentItem" @click="scroll('id6')">
              <div class="ferstPageContentItemCounter">6</div>
              <p class="ferstPageContentItemText">Обучение и повышение осведомленности персонала</p>
            </div>
            <div class="ferstPageContentItem" @click="scroll('id8')">
              <div class="ferstPageContentItemCounter">8</div>
              <p class="ferstPageContentItemText">Заключение</p>
            </div>
          </div>
        </div>
        <div class="autor">
          <div class="autorText">
            <p class="">Автор</p>
            <p class="">Алексей Смекалов</p>
          </div>
          <div class="autorBtn" @click="scroll('id1')">
            Начать чтение
          </div>
        </div>
      </div>
    </div>
    <div class="content">
      <div class="conteiner">
        <div class="contentBlock" id="id1">
          <div class="contentBlockHeader">
            <div class="cercle"></div>
            <p class="contentBlockHeaderText">Введение</p>
          </div>
          <div class="contentBlockImg">
            <img src="@/imges/content0.png" alt="" class="img">
            <div class="contentBlockImgContent">
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">01.</p>
                <p class="contentBlockTitleText">Актуальность проблемы</p>
              </div>
              <div class="contentBlockText">
                Современное информационное общество сталкивается с растущей угрозой нарушения безопасности и утечки
                персональной информации. В условиях стремительного развития технологий и повсеместного использования
                цифровых
                ресурсов, вопросы безопасности и приватности в информационных технологиях (IT) становятся более
                критическими и
                сложными. Кибератаки, хищение данных и другие формы цифровых угроз ставят под сомнение интегритет и
                конфиденциальность информации, требуя комплексного подхода к ее защите.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">02.</p>
                <p class="contentBlockTitleText">Цель и задачи исследования</p>
              </div>
              <div class="contentBlockText">
                Целью данного исследования является анализ и оценка текущего состояния безопасности и приватности в сфере
                IT,
                а также разработка рекомендаций и решений для эффективного управления рисками и защиты информации. Для
                достижения этой цели поставлены следующие задачи:<br />
                • Провести обзор современных угроз безопасности в IT.<br />
                • Исследовать основные аспекты приватности и законодательные рамки, регулирующие обработку персональных
                данных.<br />
                • Проанализировать существующие технологии обеспечения безопасности и их эффективность.<br />
                • Рассмотреть методы аутентификации и системы управления доступом.<br />
                • Изучить практики обучения и повышения осведомленности персонала по вопросам безопасности.<br />
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">03.</p>
                <p class="contentBlockTitleText">Обзор основных терминов</p>
              </div>
              <div class="contentBlockText">
                • Кибератаки: Злоумышленные действия в цифровой среде с целью несанкционированного доступа, разрушения или
                кражи конфиденциальной информации.<br />
                • Персональные данные: Информация, связанная с конкретным человеком, позволяющая его идентифицировать,
                такая
                как имена, адреса, номера телефонов.<br />
                • Аутентификация: Процесс проверки подлинности пользователя или системы для контроля доступа, часто с
                использованием паролей, биометрических данных или токенов.<br />
                • Шифрование: Механизм обеспечения конфиденциальности данных путем их преобразования в непонятный для
                посторонних вид с использованием специального ключа.<br />
                • Угрозы внутри организации: Риски и опасности, исходящие от сотрудников или внутренних актеров, такие как
                утечки данных и недостаточная безопасность паролей.<br />
                • Закон о защите данных: Нормативные акты, регулирующие сбор, хранение и обработку персональных данных с
                целью
                защиты приватности граждан.<br />
              </div>
            </div>
          </div>
        </div>
        <div class="contentBlock" id="id2">
          <div class="contentBlockHeader">
            <div class="cercle"></div>
            <p class="contentBlockHeaderText">Основные аспекты безопасности в IT</p>
          </div>
          <div class="contentBlockText">
            Продолжим рассмотрение ключевых аспектов обеспечения безопасности в информационных технологиях,
            фокусируясь
            на внешних и внутренних угрозах.
          </div>
          <div class="contentBlockImg">
            <img src="@/imges/content1.png" alt="" class="img">
            <div class="contentBlockImgContent">
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">01.</p>
                <p class="contentBlockTitleText">Защита от внешних угроз</p>
              </div>
              <div class="contentBlockText">
                <span style="font-weight: 900;">Кибератаки и их типы:</span> Кибератаки представляют собой разнообразные
                угрозы, начиная от фишинга, направленного на
                обман сотрудников и получение доступа к системе, до DDoS-атак, нацеленных на отказ в обслуживании с целью
                парализации работы ресурсов. Важно понимать различные типы атак, такие как вирусы, трояны и шпионские
                программы, для эффективной защиты от них.<br />
                <span style="font-weight: 900;">Меры предотвращения:</span>Эффективная защита от внешних угроз требует
                применения разнообразных мер. Это включает в
                себя использование современных антивирусных программ для обнаружения и блокировки вредоносных программ,
                настройку межсетевых экранов для контроля сетевого трафика, регулярное обновление программного обеспечения
                для
                закрытия уязвимостей, а также обучение сотрудников правилам безопасности и распознаванию потенциальных
                угроз.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">02.</p>
                <p class="contentBlockTitleText">Внутренние угрозы</p>
              </div>
              <div class="contentBlockText">
                Сосредотачив внимание на внешних угрозах, важно осознавать, что потенциальные риски также могут исходить
                изнутри самой организации, что делает внутренние угрозы объектом повышенного внимания.<br />
                <span style="font-weight: 900;">Угрозы со стороны персонала:</span> Сотрудники, будучи ключевым звеном в
                обеспечении безопасности, могут стать
                источником внутренних угроз. Это может включать в себя случайные действия, такие как небрежное обращение с
                конфиденциальной информацией, а также умышленные нарушения безопасности. Регулярное обучение персонала
                соблюдению безопасных практик является необходимым элементом сдерживания таких угроз.<br />
                <span style="font-weight: 900;">Риски внутренних нарушений:</span> Недостаточная осведомленность
                сотрудников,
                несанкционированный доступ к
                чувствительным данным и отсутствие эффективного мониторинга создают риски внутренних нарушений
                безопасности.
                Реализация строгих внутренних процессов и политик безопасности становится важным аспектом для минимизации
                этих
                рисков.
                Сбалансированный подход к защите от внешних и внутренних угроз является фундаментальным элементом
                обеспечения
                безопасности в IT-сфере.
              </div>
            </div>
          </div>
        </div>
        <div class="contentBlock" id="id3">
          <div class="contentBlockHeader">
            <div class="cercle"></div>
            <p class="contentBlockHeaderText">Приватность в IT</p>
          </div>
          <div class="contentBlockText">
            Рассмотрим важные аспекты приватности в информационных технологиях, учитывая обсужденные ранее вопросы
            безопасности.
          </div>
          <div class="contentBlockImg">
            <img src="@/imges/content2.png" alt="" class="img">
            <div class="contentBlockImgContent">
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">01.</p>
                <p class="contentBlockTitleText">Основные принципы обработки персональных данных</p>
              </div>
              <div class="contentBlockText">
                Основные принципы обработки персональных данных включают соблюдение законности, справедливости и
                прозрачности
                при сборе данных, ограничение целей обработки, минимизацию собираемых данных, точность и актуальность
                информации, ограничение сроков хранения, целостность и конфиденциальность данных. Эти принципы играют
                критическую роль в защите личной информации пользователей.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">02.</p>
                <p class="contentBlockTitleText">Законодательство о защите персональных данных</p>
              </div>
              <div class="contentBlockText">
                Законодательство в области защиты персональных данных служит ключевым инструментом для обеспечения
                приватности
                в IT.<br />
                <span style="font-weight: 900;">Обзор мирового опыта: </span> Мировой опыт показывает, что страны активно
                разрабатывают и усиливают законы, направленные на защиту персональных данных. Примерами являются Общий
                регламент по защите данных (GDPR) в Европейском союзе и Штатах, а также подобные законы в Канаде и
                Австралии.
                Они устанавливают высокие стандарты по сбору, хранению и обработке личной информации.<br />
                <span style="font-weight: 900;">Особенности в стране X: </span> В контексте конкретной страны (назовем ее
                страной X), законодательство может иметь свои уникальные аспекты и правила. Например, страна X может
                уделять
                внимание особенностям сбора и обработки персональных данных в онлайн-среде или в сфере здравоохранения.
                Понимание этих особенностей помогает IT-специалистам и предприятиям адаптировать свои подходы к
                обеспечению
                соблюдения местного законодательства.
                Взаимосвязь между безопасностью и приватностью в IT подчеркивает важность соблюдения законов и принципов
                обработки персональных данных для создания надежных и этичных информационных практик.
              </div>
            </div>
          </div>
        </div>
        <div class="contentBlock" id="id4">
          <div class="contentBlockHeader">
            <div class="cercle"></div>
            <p class="contentBlockHeaderText">Технологии обеспечения безопасности в IT</p>
          </div>
          <div class="contentBlockText">
            Для дополнительного обеспечения безопасности в IT важно рассмотреть эффективные технологические решения,
            взаимодействующие с ранее обсужденными аспектами безопасности и приватности.
          </div>
          <div class="contentBlockImg">
            <img src="@/imges/content3.png" alt="" class="img">
            <div class="contentBlockImgContent">
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">01.</p>
                <p class="contentBlockTitleText">Антивирусные программы и их роль</p>
              </div>
              <div class="contentBlockText">
                Антивирусные программы являются основным элементом защиты от вредоносных программ, включая вирусы, трояны
                и
                шпионские программы. Они играют ключевую роль в предотвращении кибератак и минимизации рисков
                безопасности,
                особенно в контексте защиты от внешних угроз.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">02.</p>
                <p class="contentBlockTitleText">Системы мониторинга безопасности</p>
              </div>
              <div class="contentBlockText">
                Системы мониторинга безопасности предоставляют возможность постоянного анализа активности в сети и
                системах,
                обнаруживая аномалии и предупреждая о возможных инцидентах. Интегрированные средства аналитики и машинного
                обучения позволяют оперативно реагировать на потенциальные угрозы как изнутри, так и снаружи.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">03.</p>
                <p class="contentBlockTitleText">Использование блокчейн-технологий в обеспечении безопасности</p>
              </div>
              <div class="contentBlockText">
                Блокчейн-технологии предлагают инновационный подход к обеспечению безопасности данных. Распределенные
                реестры,
                характерные для блокчейна, обеспечивают непрерывную целостность и прозрачность данных. В контексте
                приватности, блокчейн может служить механизмом управления доступом к личной информации, позволяя
                пользователям
                более полно контролировать свои данные.
                Эффективное сочетание антивирусных программ, систем мониторинга и инновационных технологий, таких как
                блокчейн, создает комплексный подход к безопасности в IT. Такие решения не только предупреждают о внешних
                и
                внутренних угрозах, но и поддерживают принципы приватности и соблюдение законов о защите данных.
              </div>
            </div>
          </div>
        </div>
        <div class="contentBlock" id="id5">
          <div class="contentBlockHeader">
            <div class="cercle"></div>
            <p class="contentBlockHeaderText">Аутентификация и управление доступом</p>
          </div>
          <div class="contentBlockText">
            В контексте обеспечения безопасности в IT, аутентификация и управление доступом играют ключевую роль,
            обеспечивая контроль и защиту входа в информационные системы.
          </div>
          <div class="contentBlockImg">
            <img src="@/imges/content4.png" alt="" class="img">
            <div class="contentBlockImgContent">
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">01.</p>
                <p class="contentBlockTitleText">Методы аутентификации</p>
              </div>
              <div class="contentBlockText">
                <span style="font-weight: 900;">Пароли и их слабые стороны:</span> Пароли остаются наиболее
                распространенным
                методом аутентификации, но они сопряжены
                с уязвимостями, такими как слабые пароли, повторное использование и подверженность атакам перебора.
                Применение
                мер безопасности, таких как двухфакторная аутентификация, является необходимым для повышения степени
                защиты
                парольных систем.<br />
                <span style="font-weight: 900;">Биометрическая аутентификация:</span> Биометрическая аутентификация,
                включая
                сканеры отпечатков пальцев,
                распознавание лица и сканирование сетчатки глаза, предоставляет более высокий уровень безопасности, так
                как
                базируется на уникальных физиологических или поведенческих характеристиках. Тем не менее, важно учитывать
                возможные риски, такие как воспроизведение биометрических данных, и предпринимать соответствующие меры
                защиты.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">02.</p>
                <p class="contentBlockTitleText">Ролевая модель управления доступом</p>
              </div>
              <div class="contentBlockText">
                Ролевая модель управления доступом представляет собой систему, где доступ к ресурсам определяется ролью
                пользователя в организации. Это позволяет эффективно управлять привилегиями, предотвращать
                несанкционированный
                доступ и минимизировать риски внутренних угроз.
                Совмещение сильных методов аутентификации, таких как биометрическая аутентификация, с ролевой моделью
                управления доступом обеспечивает комплексный подход к обеспечению безопасности и приватности в
                информационных
                технологиях. Эти меры помогают не только предотвращать несанкционированный доступ, но и эффективно
                реагировать
                на внутренние угрозы, минимизируя возможные риски для организации.
              </div>
            </div>
          </div>
        </div>
        <div class="contentBlock" id="id6">
          <div class="contentBlockHeader">
            <div class="cercle"></div>
            <p class="contentBlockHeaderText">Обучение и повышение осведомленности персонала</p>
          </div>
          <div class="contentBlockText">
            Обеспечение безопасности в IT-среде в значительной степени зависит от уровня осведомленности и готовности
            персонала к эффективным практикам безопасности. Рассмотрим роль обучения и программ повышения осведомленности
            персонала в этом контексте.
          </div>
          <div class="contentBlockImg">
            <img src="@/imges/content5.png" alt="" class="img">
            <div class="contentBlockImgContent">
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">01.</p>
                <p class="contentBlockTitleText">Роль обучения в обеспечении безопасности</p>
              </div>
              <div class="contentBlockText">
                Обучение играет ключевую роль в формировании безопасной кибергигиени в организации. Подготовленные
                сотрудники
                способны лучше распознавать потенциальные угрозы и реагировать на них. Регулярные обучающие программы
                обеспечивают актуальную информацию по современным угрозам и методам их предотвращения.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">02.</p>
                <p class="contentBlockTitleText">Программы по обучению безопасности персонала</p>
              </div>
              <div class="contentBlockText">
                <span style="font-weight: 900;">Интегрированный подход</span> Эффективные программы по обучению
                безопасности
                должны быть интегрированными и систематическими. Они должны охватывать разнообразные аспекты безопасности,
                начиная от базовых принципов использования паролей и заканчивая распознаванием фишинговых атак и
                социальной
                инженерии.<br />
                <span style="font-weight: 900;">Сценарии реальных ситуаций:</span> Использование сценариев реальных
                ситуаций и
                имитации атак позволяет сотрудникам лучше понимать потенциальные риски. Обучение через симуляции создает
                реалистичные сценарии, позволяя персоналу учиться, не подвергая реальные системы опасности.<br />
                <span style="font-weight: 900;">Меры мотивации и наград:</span> Введение мер мотивации, таких как награды
                или
                призы за соблюдение безопасных практик, стимулирует сотрудников активно участвовать в обучении и применять
                полученные знания в повседневной работе.
                Обучение и повышение осведомленности персонала тесно связаны с предыдущими разделами, такими как
                технологии
                обеспечения безопасности, ролевая модель управления доступом и методы аутентификации. Сотрудники,
                обученные
                лучшим практикам безопасности, становятся активными звеньями в цепи обеспечения безопасности, способствуя
                комплексному подходу к защите информации и приватности в организации.
              </div>
            </div>
          </div>
        </div>
        <div class="contentBlock" id="id7">
          <div class="contentBlockHeader">
            <div class="cercle"></div>
            <p class="contentBlockHeaderText">Перспективы развития безопасности и приватности в IT</p>
          </div>
          <div class="contentBlockText">
            Рассмотрим тенденции в области кибербезопасности и влияние новых технологий на безопасность, учитывая ранее
            рассмотренные аспекты обеспечения безопасности и приватности в IT.
          </div>
          <div class="contentBlockImg">
            <img src="@/imges/content6.png" alt="" class="img">
            <div class="contentBlockImgContent">
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">01.</p>
                <p class="contentBlockTitleText">Тенденции в области кибербезопасности</p>
              </div>
              <div class="contentBlockText">
                <span style="font-weight: 900;">Угрозы искусственного интеллекта (ИИ):</span> С развитием технологий ИИ
                появляются новые угрозы, такие как использование ИИ для создания усовершенствованных кибератак. Ответом на
                это
                является интеграция искусственного интеллекта в системы обнаружения и предотвращения угроз, чтобы бороться
                с
                ИИ-поддерживаемыми атаками.<br />
                <span style="font-weight: 900;">Укрепление мер безопасности IoT:</span> ИС увеличением числа подключенных
                устройств (IoT) возрастают их уязвимости. Развитие современных методов шифрования, аутентификации и
                сегментации сети помогает укреплять безопасность в экосистеме IoT.<br />
                <span style="font-weight: 900;">Облачная безопасность:</span> С увеличением использования облачных
                сервисов
                становится важным аспектом безопасности. Тенденции включают в себя улучшение инструментов управления
                доступом
                к облачным данным и усиление мер безопасности в облачных хранилищах.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">02.</p>
                <p class="contentBlockTitleText">Новые технологии и их влияние на безопасность</p>
              </div>
              <div class="contentBlockText">
                <span style="font-weight: 900;">Квантовые технологии и шифрование</span> ЭРазвитие квантовых технологий
                создает потенциальные угрозы для классического шифрования. Однако, в тоже время, исследования в области
                квантового шифрования предлагают новые методы защиты информации.<br />
                <span style="font-weight: 900;">Блокчейн в обеспечении цифровой безопасности:</span> Блокчейн не только
                обеспечивает безопасность транзакций в криптовалютах, но также предоставляет распределенные и устойчивые
                реестры для управления доступом и подтверждения целостности данных, что содействует улучшению цифровой
                безопасности.<br />
                <span style="font-weight: 900;">Машинное обучение для предотвращения угроз:</span> Применение машинного
                обучения для анализа больших объемов данных позволяет более точно выявлять и предотвращать кибератаки. Это
                включает в себя распознавание аномалий, обнаружение вторжений и предсказание потенциальных угроз.
                Итак, будущее безопасности и приватности в IT ориентировано на инновации и эволюцию технологий. Ответ на
                эти
                вызовы требует комплексного подхода, включающего в себя не только технические средства, но и обучение
                персонала, адаптацию к новым стандартам и постоянное обновление методов обеспечения безопасности.
              </div>
            </div>
          </div>
        </div>
        <div class="contentBlock" id="id8" style="padding-bottom: 150px;">
          <div class="contentBlockHeader">
            <div class="cercle"></div>
            <p class="contentBlockHeaderText">Заключение</p>
          </div>
          <div class="contentBlockImg">
            <img src="@/imges/content7.png" alt="" class="img">
            <div class="contentBlockImgContent">
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">01.</p>
                <p class="contentBlockTitleText">Подведение итогов исследования</p>
              </div>
              <div class="contentBlockText">
                Исследование безопасности и приватности в информационных технологиях выявило сложность и многогранность
                проблем, с которыми сталкиваются организации в современном цифровом мире. От анализа тенденций
                кибербезопасности до рассмотрения методов обеспечения безопасности и управления доступом, каждый аспект
                оказывает влияние на общую защиту информации и личных данных.
                В ходе исследования были рассмотрены современные угрозы, такие как кибератаки, внутренние риски и вызовы,
                связанные с обработкой персональных данных. Также были изучены технологии и методы, предназначенные для
                противодействия этим угрозам, такие как антивирусные программы, системы мониторинга, блокчейн,
                аутентификация
                и управление доступом.
              </div>
              <div class="contentBlockTitle">
                <p class="contentBlockTitleText">02.</p>
                <p class="contentBlockTitleText">Перспективы решения проблем безопасности и приватности в IT</p>
              </div>
              <div class="contentBlockText">
                Перед нами открываются перспективы усовершенствования и дальнейшего развития в области безопасности и
                приватности в IT. Интеграция новых технологий, таких как квантовые технологии, машинное обучение и
                блокчейн,
                обещает усилить меры защиты информации. Эффективные программы обучения и повышения осведомленности
                персонала
                станут важным звеном в создании культуры безопасности внутри организаций.
                Постоянное совершенствование стандартов безопасности, сотрудничество в области кибербезопасности между
                странами и отраслями, а также активная поддержка со стороны руководства станут ключевыми факторами в
                успешном
                противостоянии растущим угрозам.
                В заключение, создание устойчивых систем безопасности и приватности в IT - это процесс, требующий
                постоянного
                внимания, инноваций и совместных усилий. Однако с правильным подходом и использованием передовых
                технологий,
                организации смогут обеспечить высокий уровень защиты своей информации и данных, стремясь к цифровому
                будущему,
                где безопасность и приватность становятся неотъемлемой частью цифровой экосистемы.
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>

export default {
  name: 'App',
  components: {
  },
  methods:{
    scroll(id){
      const el = document.getElementById(id);
      el.scrollIntoView({behavior: "smooth"});
    }
  }
}
</script>

<style>@import "@/style.css";</style>
